Revit 2027 API
StructuralFramingUtils.RemoveEndReference Method
 Resets the end reference of the structural framing element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RemoveEndReference(
	FamilyInstance familyInstance,
	int end
)
Public Shared Sub RemoveEndReference (
	familyInstance As FamilyInstance,
	end As Integer
)
public:
static void RemoveEndReference(
	FamilyInstance^ familyInstance,
	int end
)
static member RemoveEndReference :
        familyInstance : FamilyInstance *
        end : int -> unit
Parameters
familyInstance FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end Int32
 The index of the end (0 for the start, 1 for the end).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  end must be 0 or 1.
ArgumentsInconsistentException |  The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set.
Remarks
 The setback value will be changed as a result of the removal.
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace